/**
 * 由tdoc m:m命令自动生成的目录映射文件
 * 用于将中文目录名映射为英文别名
 */

export default {
  "01-Assembly": "assembly", // 01-Assembly
  "01-EMU8086": "emu8086", // 01-Assembly/01-EMU8086
  "10-汇编语言": "assembly", // 01-Assembly/10-汇编语言
  "01-基础知识": "basic", // 01-Assembly/10-汇编语言/01-基础知识
  "05-寄存器": "register", // 01-Assembly/10-汇编语言/05-寄存器
  "05-计算机原理": "principle-of-computer", // 05-计算机原理
  "01-第1篇-概论": "generality", // 05-计算机原理/01-第1篇-概论
  "01-第1章-计算机系统概论": "computer-intro", // 05-计算机原理/01-第1篇-概论/01-第1章-计算机系统概论
  "02-第2篇-硬件结构": "hardware-structure", // 05-计算机原理/02-第2篇-硬件结构
  "01-第3章-系统总线": "sys-bus", // 05-计算机原理/02-第2篇-硬件结构/01-第3章-系统总线
  "02-第4章-存储器": "memory", // 05-计算机原理/02-第2篇-硬件结构/02-第4章-存储器
  "03-第5章-输入输出系统": "io-system", // 05-计算机原理/02-第2篇-硬件结构/03-第5章-输入输出系统
  "03-第3篇-中央处理器": "cpu", // 05-计算机原理/03-第3篇-中央处理器
  "03-第8章-CPU结构和功能": "structure-and-function", // 05-计算机原理/03-第3篇-中央处理器/03-第8章-CPU结构和功能
};
